ci4_ciudadanos/app/Controllers/CiudadanosController.php

    public function index(): string
    {
        //creando un objeto de tipo RegionesModel
        $ciudadano = new CiudadanosModel();
        $datos['datos'] = $ciudadano->findAll();
---
SELECT *
FROM `ciudadanos`

    public function buscarCiudadano($id=null)
    {
        $ciudadano = new CiudadanosModel();
        $datos['datos']=$ciudadano-> where ('dpi', $id )->first() ;
---
SELECT *
FROM `ciudadanos`
WHERE `dpi` = '1027318250807'
 LIMIT 1