ci4_ciudadanos/app/Controllers/DepartamentosController.php

SELECT *
FROM `departamentos`
WHERE `cod_depto` = '3'
 LIMIT 1
---
    public function buscarDepartamento($id = null)
    {
        $departamento = new DepartamentosModel();
        $datos['datos'] = $departamento->where('cod_depto', $id)->first();