ci4_ciudadanos/app/Controllers/MunicipiosController.php

    public function index(): string
    {
        //creando un objeto de tipo MunicipiosModel
        $municipio = new MunicipiosModel();
        $datos['datos'] = $municipio->findAll();
---
SELECT *
FROM `municipios`