ci4_ciudadanos/app/Controllers/NivelesAcademicosController.php

    public function index(): string
    {
        //creando un objeto de tipo nivelsModel
        $nivel = new NivelesAcademicosModel();
        $datos['datos'] = $nivel->findAll();
---
SELECT *
FROM `nivelesacademicos`