ci4_ciudadanos/app/Controllers/RegionesController.php

SELECT *
FROM `regiones`
---
    public function index(): string
    {
        //creando un objeto de tipo RegionesModel
        $region = new RegionesModel();
        $datos['datos'] = $region->findAll();

SELECT *
FROM `regiones`
WHERE `cod_region` = '8'
 LIMIT 1
---
    public function buscarRegion($id = null)
    {
        //echo "codigo: " .$id;
        $region = new RegionesModel();
        //select * from region where plan_id=$id;
        $datos['datos'] = $region->where('cod_region', $id)->first();