ci4_telefonia/app/Controllers/ClientesController.php

    public function eliminarCliente($id = null)
    {
        $cliente = new ClientesModel();
        $cliente->delete($id);
---
DELETE FROM `clientes`
WHERE `cliente_id` IN ('6')

    public function buscarCliente($id = null)
    {
        $cliente = new ClientesModel();
        $datos['datos'] = $cliente->where('cliente_id', $id)->first();
---
SELECT *
FROM `clientes`
WHERE `cliente_id` = '1'
 LIMIT 1