ci4_telefonia/app/Controllers/PlanesController.php

DELETE FROM `planes`
WHERE `plan_id` IN ('3')
---
    public function eliminarPlan($id = null)
    {
        $plan = new PlanesModel();
        $plan->delete($id);

SELECT *
FROM `planes`
WHERE `plan_id` = '2'
 LIMIT 1
---
    public function buscarPlan($id = null)
    {
        $plan = new PlanesModel();
        $datos['datos'] = $plan->where('plan_id', $id)->first();